#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan Output</summary>

```terraform
module.vpc.digitalocean_vpc.main: Refreshing state... [id=8cb88c96-d13b-41b4-a3c5-f0b59f960d74]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.doks.digitalocean_kubernetes_cluster.main will be created
  + resource "digitalocean_kubernetes_cluster" "main" {
      + cluster_subnet                   = (known after apply)
      + created_at                       = (known after apply)
      + destroy_all_associated_resources = false
      + endpoint                         = (known after apply)
      + ha                               = false
      + id                               = (known after apply)
      + ipv4_address                     = (known after apply)
      + kube_config                      = (sensitive value)
      + name                             = "theo-platform-production-doks"
      + region                           = "nyc3"
      + registry_integration             = false
      + service_subnet                   = (known after apply)
      + status                           = (known after apply)
      + surge_upgrade                    = true
      + tags                             = [
          + "environment:production",
          + "managed-by-terraform",
          + "project:theo-platform",
          + "theo-platform",
        ]
      + updated_at                       = (known after apply)
      + urn                              = (known after apply)
      + version                          = "1.31.9-do.5"
      + vpc_uuid                         = "8cb88c96-d13b-41b4-a3c5-f0b59f960d74"

      + node_pool {
          + actual_node_count = (known after apply)
          + auto_scale        = true
          + id                = (known after apply)
          + max_nodes         = 3
          + min_nodes         = 1
          + name              = "theo-platform-production-pool"
          + node_count        = 1
          + nodes             = (known after apply)
          + size              = "s-2vcpu-4gb"
          + tags              = [
              + "environment:production",
              + "managed-by-terraform",
              + "project:theo-platform",
              + "theo-platform",
            ]
        }
    }

  # module.postgresql.digitalocean_database_cluster.postgres will be created
  + resource "digitalocean_database_cluster" "postgres" {
      + database             = (known after apply)
      + engine               = "pg"
      + host                 = (known after apply)
      + id                   = (known after apply)
      + name                 = "theo-platform-production-postgresql"
      + node_count           = 1
      + password             = (sensitive value)
      + port                 = (known after apply)
      + private_host         = (known after apply)
      + private_network_uuid = "8cb88c96-d13b-41b4-a3c5-f0b59f960d74"
      + private_uri          = (sensitive value)
      + project_id           = (known after apply)
      + region               = "nyc3"
      + size                 = "db-s-2vcpu-4gb"
      + storage_size_mib     = (known after apply)
      + tags                 = [
          + "environment:production",
          + "managed-by-terraform",
          + "project:theo-platform",
          + "theo-platform",
        ]
      + uri                  = (sensitive value)
      + urn                  = (known after apply)
      + user                 = (known after apply)
      + version              = "15"

      + maintenance_window {
          + day  = "sunday"
          + hour = "04:00"
        }
    }

  # module.postgresql.digitalocean_database_db.theo_auth will be created
  + resource "digitalocean_database_db" "theo_auth" {
      + cluster_id = (known after apply)
      + id         = (known after apply)
      + name       = "theo_auth"
    }

  # module.postgresql.digitalocean_database_db.theo_platform will be created
  + resource "digitalocean_database_db" "theo_platform" {
      + cluster_id = (known after apply)
      + id         = (known after apply)
      + name       = "theo_platform"
    }

  # module.postgresql.digitalocean_database_firewall.postgres_firewall will be created
  + resource "digitalocean_database_firewall" "postgres_firewall" {
      + cluster_id = (known after apply)
      + id         = (known after apply)

      + rule {
          + created_at = (known after apply)
          + type       = "tag"
          + uuid       = (known after apply)
          + value      = "theo-platform"
        }
    }

  # module.postgresql.digitalocean_database_user.auth_api will be created
  + resource "digitalocean_database_user" "auth_api" {
      + cluster_id = (known after apply)
      + id         = (known after apply)
      + name       = "auth_api_user"
      + password   = (sensitive value)
      + role       = (known after apply)
    }

  # module.postgresql.digitalocean_database_user.platform_api will be created
  + resource "digitalocean_database_user" "platform_api" {
      + cluster_id = (known after apply)
      + id         = (known after apply)
      + name       = "platform_api_user"
      + password   = (sensitive value)
      + role       = (known after apply)
    }

  # module.redis.digitalocean_database_cluster.redis will be created
  + resource "digitalocean_database_cluster" "redis" {
      + database             = (known after apply)
      + engine               = "valkey"
      + host                 = (known after apply)
      + id                   = (known after apply)
      + name                 = "theo-platform-production-valkey"
      + node_count           = 1
      + password             = (sensitive value)
      + port                 = (known after apply)
      + private_host         = (known after apply)
      + private_network_uuid = "8cb88c96-d13b-41b4-a3c5-f0b59f960d74"
      + private_uri          = (sensitive value)
      + project_id           = (known after apply)
      + region               = "nyc3"
      + size                 = "db-s-1vcpu-1gb"
      + storage_size_mib     = (known after apply)
      + tags                 = [
          + "environment:production",
          + "managed-by-terraform",
          + "project:theo-platform",
          + "theo-platform",
        ]
      + uri                  = (sensitive value)
      + urn                  = (known after apply)
      + user                 = (known after apply)
      + version              = "8"

      + maintenance_window {
          + day  = "sunday"
          + hour = "04:00"
        }
    }

  # module.redis.digitalocean_database_firewall.redis will be created
  + resource "digitalocean_database_firewall" "redis" {
      + cluster_id = (known after apply)
      + id         = (known after apply)

      + rule {
          + created_at = (known after apply)
          + type       = "tag"
          + uuid       = (known after apply)
          + value      = "theo-platform"
        }
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + auth_db_name           = "theo_auth"
  + auth_password          = (sensitive value)
  + auth_user              = (sensitive value)
  + doks_cluster_endpoint  = (known after apply)
  + doks_cluster_id        = (known after apply)
  + doks_cluster_status    = (known after apply)
  ~ infrastructure_summary = {
      + doks        = {
          + cluster_id = (known after apply)
          + endpoint   = (known after apply)
          + status     = (known after apply)
        }
      + postgresql  = {
          + databases = [
              + "theo_auth",
              + "theo_platform",
            ]
          + host      = (known after apply)
          + port      = (known after apply)
        }
      + redis       = {
          + cluster_id = (known after apply)
          + host       = (known after apply)
          + port       = (known after apply)
        }
        # (4 unchanged attributes hidden)
    }
  + kubeconfig             = (sensitive value)
  + platform_db_name       = "theo_platform"
  + platform_password      = (sensitive value)
  + platform_user          = (sensitive value)
  + postgres_host          = (known after apply)
  + postgres_port          = (known after apply)
  + redis_cluster_id       = (known after apply)
  + redis_database         = (known after apply)
  + redis_host             = (known after apply)
  + redis_password         = (sensitive value)
  + redis_port             = (known after apply)
  + redis_uri              = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @usetheodev, Action: `pull_request`, Exit Code: 0*